change from ascii art to mermaid
